
Pusher: @MarkWarneke, Action: `pull_request`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>


```terraform
Acquiring state lock. This may take a few moments...
module.network.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet]
module.aml.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml]
module.shared.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared]
module.load-more.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more]
module.aml.random_id.randomId: Refreshing state... [id=qYIc6p6w5IyeVQ]
module.aml.module.machine_learning_workspace.azurerm_storage_account.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.Storage/storageAccounts/markwarnekemeamla9821ce]
module.aml.module.machine_learning_workspace.module.application_insights.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/microsoft.insights/components/markwarnekemeamla9821cea9eb0e48c9e55]
module.shared.random_id.randomId: Refreshing state... [id=64mJpksEEewRxA]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.OperationalInsights/workspaces/markwarnekeme]
module.shared.module.event_hub.azurerm_eventhub_namespace.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme]
module.network.random_id.randomId: Refreshing state... [id=Qg7W0bnvEqvOZg]
module.shared.module.container_registry.azurerm_container_registry.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme]
module.network.azurerm_network_security_group.allow80: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/networkSecurityGroups/markwarnekeme-allow-nsg]
module.load-more.random_id.randomId: Refreshing state... [id=krUZRQhKcaZVxg]
module.network.azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet]
module.load-more.module.application_insights.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/microsoft.insights/components/load-more]
module.load-more.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more]
module.load-more.module.cosmosdb_account.azurerm_cosmosdb_account.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.DocumentDB/databaseAccounts/load-more]
module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce]
module.shared.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared]
module.network.azurerm_subnet.backend: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-backend]
module.network.azurerm_subnet.backend_virtual_node: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-backend-aci]
module.network.azurerm_subnet.frontend: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-frontend]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.security: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/Security(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.activity: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AzureActivity(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.keyvault: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/KeyVaultAnalytics(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.maleware: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AntiMalware(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.infrastructure: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/InfrastructureInsights(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.updates: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/Updates(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.container: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.nsg: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AzureNSGAnalytics(markwarnekeme)]
module.load-more.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.network.azurerm_subnet_network_security_group_association.frontend-allow80: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-frontend]
module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.shared.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.shared.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostics: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme|markwarnekeme]
module.shared.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared|markwarnekemeshared]
module.load-more.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more|load-more]
module.aml.module.machine_learning_workspace.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce|markwarnekemeamla9821ce]
module.load-more.module.key_vault.null_resource.wait_policy: Refreshing state... [id=9121554231835175228]
module.load-more.module.kubernetes_cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more]
module.shared.module.event_hub.azurerm_eventhub.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme/eventhubs/markwarnekeme]
module.shared.module.event_hub.azurerm_monitor_diagnostic_setting.eventhub_namespace_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme|markwarnekeme]
module.aml.module.machine_learning_workspace.module.key_vault.null_resource.wait_policy: Refreshing state... [id=1750616678356796960]
module.shared.module.key_vault.null_resource.wait_policy: Refreshing state... [id=8045184661042629246]
module.load-more.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.diagnostics: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more|load-more]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aml.azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml" -> (known after apply)
      ~ location = "germanywestcentral" -> "westeurope" # forces replacement
        name     = "markwarnekeme-aml"
      - tags     = {} -> null
    }

  # module.aml.module.machine_learning_workspace.azurerm_machine_learning_workspace.main will be created
  + resource "azurerm_machine_learning_workspace" "main" {
      + application_insights_id = (known after apply)
      + container_registry_id   = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + location                = "westeurope"
      + name                    = "markwarnekemeaml"
      + resource_group_name     = "markwarnekeme-aml"
      + sku_name                = "Basic"
      + storage_account_id      = (known after apply)
      + tags                    = {
          + "id"        = "a9821cea9eb0e48c9e55"
          + "terraform" = "true"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aml.module.machine_learning_workspace.azurerm_storage_account.main must be replaced
-/+ resource "azurerm_storage_account" "main" {
      ~ access_tier                      = "Hot" -> (known after apply)
      ~ id                               = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.Storage/storageAccounts/markwarnekemeamla9821ce" -> (known after apply)
      + large_file_share_enabled         = (known after apply)
      ~ location                         = "germanywestcentral" -> "westeurope" # forces replacement
        name                             = "markwarnekemeamla9821ce"
      ~ primary_access_key               = (sensitive value)
      ~ primary_blob_connection_string   = (sensitive value)
      ~ primary_blob_endpoint            = "https://markwarnekemeamla9821ce.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                = "markwarnekemeamla9821ce.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string        = (sensitive value)
      ~ primary_dfs_endpoint             = "https://markwarnekemeamla9821ce.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                 = "markwarnekemeamla9821ce.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint            = "https://markwarnekemeamla9821ce.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                = "markwarnekemeamla9821ce.file.core.windows.net" -> (known after apply)
      ~ primary_location                 = "germanywestcentral" -> (known after apply)
      ~ primary_queue_endpoint           = "https://markwarnekemeamla9821ce.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host               = "markwarnekemeamla9821ce.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint           = "https://markwarnekemeamla9821ce.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host               = "markwarnekemeamla9821ce.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint             = "https://markwarnekemeamla9821ce.z1.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                 = "markwarnekemeamla9821ce.z1.web.core.windows.net" -> (known after apply)
      ~ secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      ~ secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      ~ secondary_location               = "germanynorth" -> (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
        tags                             = {
            "id"        = "a9821cea9eb0e48c9e55"
            "terraform" = "true"
        }
        # (8 unchanged attributes hidden)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }
    }

  # module.load-more.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
        id                         = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more|load-more"
        name                       = "load-more"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
        # (7 unchanged blocks hidden)
    }

  # module.aml.module.machine_learning_workspace.module.application_insights.azurerm_application_insights.main must be replaced
-/+ resource "azurerm_application_insights" "main" {
      ~ app_id                                = "f016b536-2a54-4f1a-85c0-92df912d1850" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/microsoft.insights/components/markwarnekemeamla9821cea9eb0e48c9e55" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "germanywestcentral" -> "westeurope" # forces replacement
        name                                  = "markwarnekemeamla9821cea9eb0e48c9e55"
        tags                                  = {
            "id"        = "a9821cea9eb0e48c9e55"
            "terraform" = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "create",
                  - "delete",
                  - "deleteissuers",
                  - "get",
                  - "getissuers",
                  - "import",
                  - "list",
                  - "listissuers",
                  - "managecontacts",
                  - "manageissuers",
                  - "setissuers",
                  - "update",
                ]
              - key_permissions         = [
                  - "backup",
                  - "create",
                  - "decrypt",
                  - "delete",
                  - "encrypt",
                  - "get",
                  - "import",
                  - "list",
                  - "purge",
                  - "recover",
                  - "restore",
                  - "sign",
                  - "unwrapKey",
                  - "update",
                  - "verify",
                  - "wrapKey",
                ]
              - object_id               = "dde8affe-86ad-46e2-b728-691e676b4eb3"
              - secret_permissions      = [
                  - "backup",
                  - "delete",
                  - "get",
                  - "list",
                  - "purge",
                  - "recover",
                  - "restore",
                  - "set",
                ]
              - storage_permissions     = []
              - tenant_id               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce" -> (known after apply)
      ~ location                        = "germanywestcentral" -> "westeurope" # forces replacement
        name                            = "markwarnekemeamla9821ce"
      - purge_protection_enabled        = false -> null
      - soft_delete_retention_days      = 0 -> null
        tags                            = {
            "id"        = "a9821cea9eb0e48c9e55"
            "terraform" = "true"
        }
      ~ vault_uri                       = "https://markwarnekemeamla9821ce.vault.azure.net/" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault_access_policy.sp_terraform must be replaced
-/+ resource "azurerm_key_vault_access_policy" "sp_terraform" {
      ~ id                      = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kv_diag_settings" {
      ~ id                         = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce|markwarnekemeamla9821ce" -> (known after apply)
        name                       = "markwarnekemeamla9821ce"
      ~ target_resource_id         = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.KeyVault/vaults/markwarnekemeamla9821ce" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 1 to change, 6 to destroy.

```


</details>
